Autodesk.Revit.DB.Structure.RebarHandleType.CustomHandle
Custom handle used in API constraints. The handle itself and the behavior of this type of handle
is defined in the API (see Autodesk::Revit::DB::Structure::IRebarUpdateServer).
This handle defines a symbolic part of the rebar
and is not tied to a specific segment or part of the rebar.
Handles that represent the start and end of a bar should not be of this type.